In [22]:
# import libraries
import pandas as pd
import numpy as np

DATA CLEANING

In [23]:
df = pd.DataFrame({
    "Name": [" Alice ", "Bob", "Charlie", "Bob"],
    "Age": [20, np.nan, 22 , 20],
    "City": ["Delhi", "delhi", None, "Delhi"],
    "CGPA": [8.5, 9.1, None, 8.5]
})

In [24]:
df.head()

      Name   Age   City  CGPA
0   Alice   20.0  Delhi   8.5
1      Bob   NaN  delhi   9.1
2  Charlie  22.0    NaN   NaN
3      Bob  20.0  Delhi   8.5

In [25]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      str
 1   Age     3 non-null      float64
 2   City    3 non-null      str
 3   CGPA    3 non-null      float64
dtypes: float64(2), str(2)
memory usage: 260.0 bytes

In [26]:
df.describe()

             Age     CGPA
count   3.000000  3.00000
mean   20.666667  8.70000
std     1.154701  0.34641
min    20.000000  8.50000
25%    20.000000  8.50000
50%    20.000000  8.50000
75%    21.000000  8.80000
max    22.000000  9.10000

In [27]:
df.isna().sum()

Name    0
Age     1
City    1
CGPA    1
dtype: int64

In [28]:
df["Age"] = df["Age"].fillna(df["Age"].mean())

In [29]:
df["City"] = df["City"].fillna("Unknown")

In [30]:
df["CGPA"] = df["CGPA"].interpolate()

In [31]:
df.head()

      Name        Age     City  CGPA
0   Alice   20.000000    Delhi   8.5
1      Bob  20.666667    delhi   9.1
2  Charlie  22.000000  Unknown   8.8
3      Bob  20.000000    Delhi   8.5

In [32]:
df.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [33]:
df.drop_duplicates()

      Name        Age     City  CGPA
0   Alice   20.000000    Delhi   8.5
1      Bob  20.666667    delhi   9.1
2  Charlie  22.000000  Unknown   8.8
3      Bob  20.000000    Delhi   8.5

In [34]:
df["Age"] = pd.to_numeric(df["Age"], errors = "coerce")

In [35]:
df["Name"] = df["Name"].str.strip()

In [36]:
df["City"] = df["City"].str.title()

In [37]:
df["City"] = df["City"].replace("Unknown", "Delhi")

In [38]:
df.head()

      Name        Age   City  CGPA
0    Alice  20.000000  Delhi   8.5
1      Bob  20.666667  Delhi   9.1
2  Charlie  22.000000  Delhi   8.8
3      Bob  20.000000  Delhi   8.5

DATA TRANSFORMATION

In [45]:
# log-transformation
df["CGPA_log"] = np.log(df["CGPA"])

In [46]:
# reciprocal transformation
df["CGPA_reciprocal"] = 1 / (df["CGPA"])

In [47]:
# square transformation
df["CGPA_square"] = (df["CGPA"]) ** 2

In [48]:
# square-root transformation
df["CGPA_sqrt"] = (df["CGPA"]) ** 0.5

In [49]:
df.head()

,Name,Age,City,CGPA,CGPA_log,CGPA_reciprocal,CGPA_sqrt,CGPA_square
0,Alice,20.000000,Delhi,8.5,2.140066,0.117647,2.915476,72.25
1,Bob,20.666667,Delhi,9.1,2.208274,0.109890,3.016621,82.81
2,Charlie,22.000000,Delhi,8.8,2.174752,0.113636,2.966479,77.44
3,Bob,20.000000,Delhi,8.5,2.140066,0.117647,2.915476,72.25